Documents/ВыпускОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ВыпускОбучающихся</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктуальностьКонтингента</xr:Item>
				<xr:Item>AccumulationRegister.ЧисленностьГруппы</xr:Item>
				<xr:Item>AccumulationRegister.АктивныйКонтингент</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обучающиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контингент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийБалл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыпускОбучающихся/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВыпускОбучающихся.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыпускОбучающихся.Автор,
	|	ВыпускОбучающихся.Группа,
	|	ВыпускОбучающихся.Дата,
	|	ВыпускОбучающихся.Номер,
	|	ВыпускОбучающихся.Обучающиеся.(
	|		НомерСтроки,
	|		ФИО,
	|		СреднийБалл
	|	)
	|ИЗ
	|	Документ.ВыпускОбучающихся КАК ВыпускОбучающихся
	|ГДЕ
	|	ВыпускОбучающихся.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОбучающиесяШапка = Макет.ПолучитьОбласть("ОбучающиесяШапка");
	ОбластьОбучающиеся = Макет.ПолучитьОбласть("Обучающиеся");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОбучающиесяШапка);
		ВыборкаОбучающиеся = Выборка.Обучающиеся.Выбрать();
		Пока ВыборкаОбучающиеся.Следующий() Цикл
			ОбластьОбучающиеся.Параметры.Заполнить(ВыборкаОбучающиеся);
			ТабДок.Вывести(ОбластьОбучающиеся, ВыборкаОбучающиеся.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
